docs/emacs-org-mode-100-books.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-21 Sat 10:50 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs, org-mode and 100 books in a year</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/style.css' />
<link rel='icon' type='image/png' href='/favicon.png'>
</head>
<body>
<div id="org-div-home-and-up">
                               <a accesskey="H" href="/">Home</a>
                               </div><div id="content" class="content">
<header>
<h1 class="title">Emacs, org-mode and 100 books in a year</h1>
</header><p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-01-30 Sat&gt;</span></span>
</p>

<p>
Last couple of years I keep track of books I read. I've been doing it in different way and over time I improved the way I do it.
</p>

<p>
Why do I need to record the books?
</p>
<ol class="org-ol">
<li>I read quite a lot and can forget what I read after a few years</li>
<li>Along with the book I write my thoughts about it and what I learned</li>
<li>I am listening a lot of audiobooks and it's interesting to track how many hours I listened in total</li>
</ol>

<p>
What I need?
</p>
<ol class="org-ol">
<li>Easy way to keep list of books</li>
<li>Easy way to keep track of when I finished reading, how many hours the book, etc.</li>
<li>The way to count the number of hours I listened the books through the year (automatically)</li>
</ol>

<p>
So, org-mode is ideal for this.
</p>

<div class="org-src-container">
<pre class="src src-org">  * 2020 <span style="color: #859900; font-weight: bold;">[100/100]</span>

  ** DONE Fooled by Randomness
  <span style="color: #93a1a1; font-weight: bold;">CLOSED:</span> <span style="color: #268bd2; text-decoration: underline;">[2020-12-31 Thu 18:32]</span>
  <span style="color: #2aa198;">:PROPERTIES:</span>
  <span style="color: #93a1a1; font-weight: bold;">:author:</span>   Nassim Nicholas Taleb
  <span style="color: #93a1a1; font-weight: bold;">:year:</span>     2001
  <span style="color: #93a1a1; font-weight: bold;">:name:</span>     Fooled by Randomness: The Hidden Role of Chance in Life and in the Markets
  <span style="color: #2aa198;">:END:</span>

  My thoughts about book

  ** DONE Hitchhiker's Guide to the Galaxy
  <span style="color: #93a1a1; font-weight: bold;">CLOSED:</span> <span style="color: #268bd2; text-decoration: underline;">[2020-12-29 Tue 18:27]</span>
  <span style="color: #2aa198;">:PROPERTIES:</span>
  <span style="color: #93a1a1; font-weight: bold;">:author:</span>   Douglas Adams
  <span style="color: #93a1a1; font-weight: bold;">:length:</span>   12:47
  <span style="color: #93a1a1; font-weight: bold;">:year:</span>     1996
  <span style="color: #2aa198;">:END:</span>

  42

  ...
</pre>
</div>

<p>
As you can see, 1st-level headline indicates each year, it contains the number of books I read. 2nd-level headlines is the books, where I write the title of the book. If it's too big, I put it in the properties <code>name</code>.
Also, I keep the book's state:
</p>

<ul class="org-ul">
<li><code>TODO</code>: want to read in the nearest time</li>
<li><code>DOING</code>: reading right now</li>
<li><code>DONE</code>: finished</li>
</ul>

<p>
When state goes to DONE org-mode sets date for me, so I can know when finished reading.
In the properties I record <code>author</code>, <code>length</code> if this is audiobook and other optional info like <code>year</code>.
</p>

<p>
If I like the book I set the tag <code>:like:</code>. This is the books that I would read again and they influenced me a lot.
</p>

<p>
This is all quite basic, but here is comes the best part, org mode will build a table with all the books I read. And count how many hours I listened in total.
</p>

<p>
This is done by using column view, everything beyond <code>#+BEGIN</code> is generated automatically. (shortened for readability)
</p>

<div class="org-src-container">
<pre class="src src-org">  * 2020 <span style="color: #859900; font-weight: bold;">[100/100]</span>

<span style="color: #93a1a1; font-style: italic;">  #+TAGS: like(l)</span>
<span style="color: #93a1a1; font-style: italic;">  #+COLUMNS: %author(Author) %32ITEM(Name) %TODO %TAGS(Tags) %length(Total){:}</span>

<span style="color: #93a1a1; font-style: italic;">  #+BEGIN: columnview :hlines 1 :id local :skip-empty-rows t</span>
  <span style="color: #859900;">| Author                | Name                             | TODO | Tags |  Total |</span>
  <span style="color: #859900;">|-----------------------+----------------------------------+------+------+--------|</span>
  <span style="color: #859900;">|                       | 2020                             |      |      | 788:17 |</span>
  <span style="color: #859900;">| Nassim Nicholas Taleb | Fooled by Randomness             | DONE |      |        |</span>
  <span style="color: #859900;">| Douglas Adams         | Hitchhiker's Guide to the Galaxy | DONE |      |  12:47 |</span>
  ...

  ** DONE Fooled by Randomness...
  ** DONE Hitchhiker's Guide to the Galaxy...
</pre>
</div>

<p>
So as you can see, I "spent" 788 hours (around 32 days) listening audiobooks.
That's quite amazing I think, it is 1 month out of 12 in the year!
</p>

<p>
But here is a great part about audiobooks, I didn't "spent" time or waste it. During listening I am usually running, cycling, walking or doing some other things.
Imagine if I read all this books, I would literally "wasted" 1/12 of the year in reading, cause that's a lot of time. Even if you read faster that's too much anyway.
</p>

<p>
Also, as I am working many hours in a day on computer my eyes are quite tired and making them work even more by reading books won't do any good for them.
So with audiobooks I am able to exercise, enjoy books and rest my eyes at the same time.
</p>

<p>
<b>Conclusion</b>
</p>

<p>
I don't think that number of books you read is really matter.
</p>

<p>
<code>Number of books that influenced and changed you is what matters.</code>
</p>

<p>
But it was a challenge for me and it happened that I did it though didn't think I will hit a hundred at the end of the year.
</p>

<p>
I really like audiobooks, I am listening for over 10 years. I remember that firstly it was difficult to focus but over time my auditory memory improved.
Often, when I find myself thinking about or dreaming and I turn off the book and listen to the music or birds in the park.
</p>

<p>
Enjoy books, enjoy music, enjoy life.
</p>

<p>
Links
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/">Org mode</a></li>
<li><a href="https://orgmode.org/manual/Column-View.html#Column-View">Org-mode column view</a></li>
<li><a href="https://orgmode.org/manual/Properties-and-Columns.html#Properties-and-Columns">Org-mode properties</a></li>
</ul>
</div>
<div id="postamble" class="status">
<hr>
To get in touch, email me at <a href="mailto:reacsdas@gmail.com">reacsdas@gmail.com</a> <br /><br />
Discuss and comment in <a href="https://t.me/reacsdas">Telegram</a> | <a href="https://github.com/paul-nameless">Github</a> | <a href="https://twitter.com/paul_nameless">Twitter</a><br/>

<!-- Cloudflare Web Analytics -->
<script defer src='https://static.cloudflareinsights.com/beacon.min.js' data-cf-beacon='{"token": "2c0ad197c226461eaccf6861b45f1cf8"}'>
</script>
<!-- End Cloudflare Web Analytics -->
</div>
</body>
</html>
